In [1]:
import pandas as pd 
import matplotlib.pyplot as plt

In [3]:

data = pd.read_csv(r"C:\Users\Lenovo\OneDrive\Documents\Projects\Luke Barousse Projects\Python Course  Data Analysis\data_jobs.csv")
df=data

In [4]:
df.columns

Index(['job_title_short', 'job_title', 'job_location', 'job_via',
       'job_schedule_type', 'job_work_from_home', 'search_location',
       'job_posted_date', 'job_no_degree_mention', 'job_health_insurance',
       'job_country', 'salary_rate', 'salary_year_avg', 'salary_hour_avg',
       'company_name', 'job_skills', 'job_type_skills'],
      dtype='object')

In [10]:
df.loc[:10,'salary_rate':'salary_year_avg']

   salary_rate  salary_year_avg
0          NaN              NaN
1          NaN              NaN
2          NaN              NaN
3          NaN              NaN
4          NaN              NaN
5          NaN              NaN
6          NaN              NaN
7          NaN              NaN
8          NaN              NaN
9          NaN              NaN
10         NaN              NaN

In [15]:
median_salary_year=df['salary_year_avg'].median()

In [23]:
median_salary_hour=df['salary_hour_avg'].median()

In [19]:
df_filled=df
df_filled['salary_year_avg']=df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg']=df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [24]:
df_filled['salary_year_avg']
df_filled['salary_hour_avg']

0         45.965
1         45.965
2         45.965
3         45.965
4         45.965
           ...
787681    45.965
787682    45.965
787683    45.965
787684    45.965
787685    45.965
Name: salary_hour_avg, Length: 787686, dtype: float64

In [25]:
df_filled.loc[:10,'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0           45.965
1          115000.0           45.965
2          115000.0           45.965
3          115000.0           45.965
4          115000.0           45.965
5          115000.0           45.965
6          115000.0           45.965
7          115000.0           45.965
8          115000.0           45.965
9          115000.0           45.965
10         115000.0           45.965

In [31]:
df_unique=df_filled 
df_unique=df_unique.drop_duplicates()
print(len(df))
print(len(df_filled))
print(len(df_filled)-len(df_unique))

787686
787686
109

In [33]:
df_unique=df_filled 
df_unique=df_unique.drop_duplicates(subset=['job_title','company_name'])
print(len(df))
print(len(df_filled))
print(len(df_filled)-len(df_unique))

787686
787686
278789